# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "adoptopenjdk/openjdk"

# utilities
brew "antigen"
brew "bat"
brew "chruby"
brew "exa"
brew "fd"
brew "fzf"
brew "git-delta"
brew "gnuplot"
brew "htop"
brew "icdiff"
brew "imagemagick"
brew "libfaketime"
brew "neovim"
brew "q"
brew "ruby-install"
brew "scrcpy"
brew "stow"
brew "textql"
brew "tig"
brew "tree"
brew "watch"
brew "wget"

# GnuPG and GPGTools/pinentry-mac
brew "gnupg"
brew "pinentry-mac"

# Java
brew "openjdk"
brew "maven"
brew "ant"
brew "gradle"
brew "jenv"
cask "java6"
cask "adoptopenjdk/openjdk/adoptopenjdk8"
cask "adoptopenjdk/openjdk/adoptopenjdk11"
cask "eclipse-java"

# casks
cask "authy"
cask "caffeine"
cask "deezer"
cask "deskreen"
cask "docker"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iterm2"
cask "keepassx"
cask "keybase"
cask "spotify"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "whatsapp"

# android
cask "android-file-transfer"
cask "android-platform-tools"

# fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
